# SetDefaultOpacity

## Description
Sets the default opacity to document.

```pascal
PROCEDURE SetDefaultOpacity(opacity : INTEGER);
```

```python
def vs.SetDefaultOpacity(opacity):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|opacity|INTEGER|The opacity as percent value in range [0-100].|

## Version
Availability: from VectorWorks13.0

## Category
* Document Attributes